xml2груминг/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОплатаДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура ПересчитатьСуммуДокумента()
   	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма")+ Объект.Товары.Итог("Сумма");
 КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,СтрокаТЧ.ВидЦены);
	Иначе
		СтрокаТЧ.Сумма = 0;		
	КонецЕсли;    
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидЦеныПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,СтрокаТЧ.ВидЦены);
	Иначе
		СтрокаТЧ.Сумма = 0;		
	КонецЕсли;
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,СтрокаТЧ.ВидЦены);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчитатьСуммуДокумента();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидЦеныПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,СтрокаТЧ.ВидЦены);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
   	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма")+ Объект.Товары.Итог("Сумма");
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаДокументОснование = Документы.ЗаписьКлиента.ПроверитьОказаниеУслуг(Параметры.Основание);
	Если Параметры.Свойство("Основание")
	    И ЗначениеЗаполнено(Параметры.Основание)
	    И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаписьКлиента")  //1
	    И СсылкаНаДокументОснование <> Ложь Тогда
    	СообщениеПользователю = Новый СообщениеПользователю(); //2
        СообщениеПользователю.Текст = СтрШаблон("Для документа уже введён документ реализации %1!",СсылкаНаДокументОснование);
        СообщениеПользователю.Сообщить();
        Отказ = Истина;
        возврат;
	КонецЕсли;
	
	

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПризнакОплаты = Перечисления.ОплатаДокумента.НеОплачен; 
	Иначе
		СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Объект.Ссылка);
		Объект.ПризнакОплаты = СтруктураОплаты.ПризнакОплаты;
	КонецЕсли;
		
		
КонецПроцедуры
